---
kind: method
id: M:Autodesk.Revit.DB.Viewport.GetBoxOutline
source: html/034750ce-be6c-456b-7f3f-ee0ab5b5e2c0.htm
---
# Autodesk.Revit.DB.Viewport.GetBoxOutline Method

Returns the outline of the viewport on the sheet, excluding the viewport label.

## Syntax (C#)
```csharp
public Outline GetBoxOutline()
```

## Returns
The outline of the viewport on the sheet.

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - The viewport is not on a sheet.